app/controllers/songs_controller.rb

  def show
    @artist = Artist.find_by(id: params[:artist_id])
    @song = Song.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @artist = Artist.find_by(id: params[:artist_id])
    @song = Song.find_by(id: params[:id])

    if params[:artist_id] && !@artist
      redirect_to artists_path, alert: "Artist not found."
    elsif !@song || (@artist && !@artist.songs.include?(Song.find(params[:id])))
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 6]]